using Bulgarikon.Data.Models;
using Bulgarikon.Data.Seed;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;

namespace Bulgarikon.Data.Configurations
{
    public class EraConfiguration : IEntityTypeConfiguration<Era>
    {
        public void Configure(EntityTypeBuilder<Era> builder)
        {
            builder.HasData(
                new Era
                {
                    Id = SeededIds.Era_Antiquity,
                    Name = "Античност",
                    Description = "Един от най-ранните периоди от човешката история на Балканския полуостров, белязан от възхода на тракийската цивилизация и по-късно римското завоевание." +
                    " Траките, един от най-древните народи в Европа, създават богата култура с впечатляващи постижения в металообработването, изкуството и архитектурата." +
                    " Оставят след себе си великолепни съкровища (Панагюрско, Вълчитрънско), монументални гробници (Казанлъшка, Свещарска) и наследство, което ще влияе на региона в продължение на хилядолетия." +
                    " Римляните завладяват тези земи през I век сл. Хр., създавайки провинции като Мизия и Тракия, строейки градове, пътища и укрепления, които могат да се видят и днес.",
                    StartYear = -6000,
                    EndYear = 600
                },
                new Era
                {
                    Id = SeededIds.Era_MigrationPeriod,
                    Name = "Период на миграции",
                    Description = "Период на значителни движения на населението в Европа (IV-VII век), белязан от пристигането на славяни и прабългари на Балканите. Славяните, индоевропейски народ, започват да се заселват масово на полуострова през VI-VII век," +
                    " донасяйки своя език, земеделски практики и общинна организация. Прабългарите, народ от централноазиатски произход с високоорганизирана военна структура, създават Стара Велика България (632-668) под управлението на хан Кубрат в степите северно от Черно море." +
                    " След разпадането ѝ под натиска на хазарите, хан Аспарух повежда група прабългари на запад, установявайки се в района на днешна Добруджа и полагайки основите на бъдещата българска държава.",
                    StartYear = 300,
                    EndYear = 700
                },
                new Era
                {
                    Id = SeededIds.Era_FirstBulgarianEmpire,
                    Name = "Първо българско царство",
                    Description = "Първата българска държава, основана през 681 г. след победата на хан Аспарух над Византийската империя при битката при Онгъла. Това бележи официалното признаване на България като суверенна държава от Византия." +
                    " При управлението на хан Крум (803-814) държавата се разширява значително и получава първите си писани закони. Най-забележителният период е Златният век при цар Симеон I (893-927), когато България става най-голямата държава в Европа," +
                    " простираща се на три морета, и център на славянската книжнина и култура. Преславската и Охридската книжовни школи процъфтяват, а кирилицата е създадена. Християнството е прието за държавна религия през 864 г. при княз Борис I," +
                    " интегрирайки България в европейското християнско семейство. Царството пада под византийска власт през 1018 г., като най-тежък разгром преживява през 1014г., когато се състои битката при с.Ключ.",
                    StartYear = 681,
                    EndYear = 1018
                },
                new Era
                {
                    Id = SeededIds.Era_SecondBulgarianEmpire,
                    Name = "Второ българско царство",
                    Description = "Възстановената българска държава, създадена след успешното въстание на братята Асен и Петър през 1185 г. с център Търново. България отново се превръща в основна балканска сила." +
                    " Цар Калоян (1197-1207) разгромява кръстоносците при битката при Одрин (1205). Царството достига най-голямото си териториално разширение и културен разцвет при цар Иван Асен II (1218-1241)," +
                    " който разширява границите му до три морета и превръща Търново във водещ политически и културен център, известен като 'Царевград'. Търновската книжовна школа се развива, а архитектурни паметници" +
                    " като църквите в Несебър и Ивановските скални църкви са създадени. След средата на XIII век феодалната раздробеност отслабва държавата, което улеснява османското нашествие. Търново пада през 1393 г.," +
                    " а Видинското царство през 1396 г., слагайки край на средновековната българска държавност.",
                    StartYear = 1185,
                    EndYear = 1396
                },
                new Era
                {
                    Id = SeededIds.Era_OttomanPeriod,
                    Name = "Османски период",
                    Description = "Близо пет века османско владичество (1396-1878) коренно променят социално-икономическия и културен живот на българските земи." +
                    " Въведена е нова административна система (спахийско-тимарска система), наложени са тежки данъци (джизя, испенче, десятък) и са въведени ограничения като кръвния данък (девширме)." +
                    " Въпреки опитите за асимилация и ислямизация в някои райони, българският народ запазва своя език, вяра и обичаи чрез църквата, манастирите, семейството и фолклора." +
                    " През XVII-XVIII век започва икономически подем, довел до разцвет на Българското възраждане. Този период се характеризира с борба за църковна независимост," +
                    " развитие на образованието и културата и организиране на националноосвободителни движения, кулминиращи в Априлското въстание (1876) и Освобождението през 1878 г.",
                    StartYear = 1396,
                    EndYear = 1878
                },
                new Era
                {
                    Id = SeededIds.Era_Revival,
                    Name = "Българско възраждане",
                    Description = "Културен, просветен и политически процес (XVIII-XIX век), довел до формирането на българската нация и възстановяването на българската държавност." +
                    " Началото му се свързва с 'История славянобългарска' на Паисий Хилендарски (1762), която пробужда националното самосъзнание. През XIX век се разгръща борба за независима българска църква" +
                    " (учредена като Българска екзархия през 1870 г.), създават се училища и читалища, въвежда се светско образование." +
                    " В средата на века започва организирано революционно движение, ръководено от Георги Раковски, Любен Каравелов и Васил Левски. Априлското въстание (1876) е кулминация на борбите и довежда " +
                    "до Руско-турската война (1877-1878) и възстановяването на българската държавност.",
                    StartYear = 1762,
                    EndYear = 1878
                },
                new Era
                {
                    Id = SeededIds.Era_Modern,
                    Name = "Съвременна България",
                    Description = "Период на възстановена държавност, преминал през трудния път на политическо и икономическо развитие. След Освобождението (1878) е създадена Третата българска държава," +
                    " първо като Княжество, а от 1908 г. като Царство. Съединението (1885) затвърждава националното обединение. България участва в Балканските войни (1912-1913)," +
                    " Първата световна война и Втората световна война, които водят до национални катастрофи. След Втората световна война България попада в съветската сфера на влияние и започва период на социалистическо управление (1944-1989)." +
                    " След промените през 1989 г. страната поема по пътя на демократичните реформи и пазарна икономика, присъединявайки се към НАТО (2004) и Европейския съюз (2007).",
                    StartYear = 1878,
                    EndYear = 2025
                }
            );
        }
    }
}